{
  "patterns": [
    {
      "pattern_id": "karmic_echo_unworthiness",
      "pattern_name": "Echoes of Unworthiness",
      "keywords_and_themes": ["self-doubt", "imposter syndrome", "not good enough", "comparison", "childhood conditioning"],
      "modern_context": "A persistent feeling of inadequacy and self-doubt, often stemming from past experiences or societal pressures, making it difficult to acknowledge achievements or feel worthy of success.",
      "mythological_archetype": {
        "source": "Story of Karna (Mahabharata)",
        "summary": "Karna, despite his immense skill and valor, was constantly plagued by questions of his lineage and societal acceptance. His life was a testament to battling perceived unworthiness and seeking validation, often leading to choices that had profound karmic consequences. He felt he had to prove himself more than others due to the circumstances of his birth."
      },
      "philosophical_guidance": {
        "core_concept": "Swadharma & Atma-Vishwas (One's Own Dharma & Self-Confidence)",
        "explanation": "Understanding and accepting your true nature and duties (Swadharma) without external validation is key. Cultivating self-belief (Atma-Vishwas) comes from within, not from societal approval. Recognize that inherent worth is not tied to external achievements or perceptions."
      },
      "dharmic_guidance": [
        "Reflect on the source of your self-doubt. Are these beliefs truly yours or imposed by others?",
        "Practice self-compassion. Acknowledge your efforts and achievements, no matter how small.",
        "Identify your unique strengths and focus on tasks aligned with your true nature (Swadharma).",
        "Seek environments and relationships that affirm your worth and support your growth."
      ],
      "translations": {
        "hi": {
          "pattern_name": "अयोग्यता की गूंज",
          "modern_context": "अपर्याप्तता और आत्म-संदेह की एक निरंतर भावना, जो अक्सर पिछले अनुभवों या सामाजिक दबावों से उत्पन्न होती है, जिससे उपलब्धियों को स्वीकार करना या सफलता के योग्य महसूस करना मुश्किल हो जाता है।"
        },
        "bho": {
          "pattern_name": "अयोग्यता के गूंज",
          "modern_context": "अपर्याप्तता आ आत्म-संदेह के एगो निरंतर भावना, जवन अक्सर पिछला अनुभव भा सामाजिक दबाव से पैदा होला, जेकरा चलते उपलब्धि के स्वीकार कईल भा सफलता के लायक महसूस कईल मुश्किल हो जाला।"
        },
        "pa": {
          "pattern_name": "ਅਯੋਗਤਾ ਦੀਆਂ ਗੂੰਜਾਂ",
          "modern_context": "ਅਪੂਰਨਤਾ ਅਤੇ ਸਵੈ-ਸ਼ੱਕ ਦੀ ਇੱਕ ਨਿਰੰਤਰ ਭਾਵਨਾ, ਜੋ ਅਕਸਰ ਪਿਛਲੇ ਤਜ਼ਰਬਿਆਂ ਜਾਂ ਸਮਾਜਿਕ ਦਬਾਵਾਂ ਤੋਂ ਪੈਦਾ ਹੁੰਦੀ ਹੈ, ਜਿਸ ਨਾਲ ਪ੍ਰਾਪਤੀਆਂ ਨੂੰ ਸਵੀਕਾਰ ਕਰਨਾ ਜਾਂ ਸਫਲਤਾ ਦੇ ਯੋਗ ਮਹਿਸੂਸ ਕਰਨਾ ਮੁਸ਼ਕਲ ਹੋ ਜਾਂਦਾ ਹੈ।"
        }
      }
    },
    {
      "pattern_id": "dharma_confusion_crossroads",
      "pattern_name": "Dharma at the Crossroads",
      "keywords_and_themes": ["career choices", "relationship decisions", "societal expectations", "parental pressure", "finding purpose", "moral dilemma", "life path"],
      "modern_context": "Feeling torn between societal/family expectations and personal desires regarding major life choices (career, relationships), leading to confusion about one's true path or Dharma.",
      "mythological_archetype": {
        "source": "Arjuna's Dilemma (Bhagavad Gita)",
        "summary": "At the precipice of the Kurukshetra war, Arjuna was overcome with despair at the thought of fighting his own kinsmen, teachers, and elders. He questioned his duty (Dharma) as a warrior versus the emotional toll of violence against loved ones, symbolizing a profound internal conflict about right action in the face of overwhelming personal and societal stakes."
      },
      "philosophical_guidance": {
        "core_concept": "Nishkama Karma (Action without Attachment to Outcome) & Swadharma",
        "explanation": "The Bhagavad Gita advises performing one's duty (Swadharma) without attachment to the results. Clarity comes from focusing on right action based on your intrinsic nature and role, rather than being swayed solely by external pressures or desired outcomes. Introspection is key to discerning your Swadharma."
      },
      "dharmic_guidance": [
        "Identify the core values that are non-negotiable for you.",
        "List the pros and cons of each path, considering both your desires and responsibilities.",
        "Seek counsel from a trusted mentor or elder who understands your values.",
        "Practice discernment: which path aligns most with your authentic self and long-term well-being?"
      ],
      "translations": {
        "hi": {
          "pattern_name": "धर्म चौराहे पर",
          "modern_context": "प्रमुख जीवन विकल्पों (करियर, रिश्ते) के संबंध में सामाजिक/पारिवारिक अपेक्षाओं और व्यक्तिगत इच्छाओं के बीच फटा हुआ महसूस करना, जिससे व्यक्ति के सच्चे मार्ग या धर्म के बारे में भ्रम पैदा होता है।"
        },
        "bho": {
          "pattern_name": "धर्म चौराहा पर",
          "modern_context": "प्रमुख जीवन विकल्प (करियर, रिश्ता) के संबंध में सामाजिक/पारिवारिक उम्मीद आ व्यक्तिगत इच्छा के बीच में फटल महसूस कईल, जेकरा चलते सच्चा मार्ग भा धर्म के बारे में भ्रम पैदा होला।"
        },
        "pa": {
          "pattern_name": "ਧਰਮ ਚੁਰਾਹੇ 'ਤੇ",
          "modern_context": "ਮੁੱਖ ਜੀਵਨ ਚੋਣਾਂ (ਕਰੀਅਰ, ਰਿਸ਼ਤੇ) ਦੇ ਸਬੰਧ ਵਿੱਚ ਸਮਾਜਿਕ/ਪਰਿਵਾਰਕ ਉਮੀਦਾਂ ਅਤੇ ਨਿੱਜੀ ਇੱਛਾਵਾਂ ਵਿਚਕਾਰ ਫਸਿਆ ਮਹਿਸੂਸ ਕਰਨਾ, ਜਿਸ ਨਾਲ ਵਿਅਕਤੀ ਦੇ ਅਸਲ ਮਾਰਗ ਜਾਂ ਧਰਮ ਬਾਰੇ ਭੁਲੇਖਾ ਪੈਦਾ ਹੁੰਦਾ ਹੈ।"
        }
      }
    }
  ]
}